In [1]:
import pandas as pd
import numpy as np

# Read dataset

In [2]:
pymarket = pd.read_csv('../datasets/pymarket.csv')
pymarket.head()

        dates     Tom     Joe  Charlie
0  10/16/2016  131.10   18.78   210.34
1  10/17/2016  459.13  424.17   176.03
2  10/18/2016  338.39  376.78   334.06
3  10/19/2016  361.32  349.26   456.03
4  10/20/2016   25.39  434.77   462.00

### 1) How much Tom has expend in the market
return a value

In [3]:
# Answer 1
pymarket['Tom'].sum()

222564.53

### 2) Total and mean of Tom and Joe expenses  
return a dataframe

In [4]:
pymarket[['Tom','Joe']].agg(['sum', 'mean'])

                Tom           Joe
sum   222564.530000  214566.86000
mean     244.307936     237.61557

### 3) Which are the days in which the friends expensed more than $100 together  
return series

In [5]:
pymarket.loc[pymarket.sum(axis=1) > 100]['dates'].head() #just print first 5 elements

0    10/16/2016
1    10/17/2016
2    10/18/2016
3    10/19/2016
4    10/20/2016
Name: dates, dtype: object

### 4) Which are the days in wich the friends didnt go to the market, any of them
return list of string of dates

In [6]:
# first convert datime to index, to work better
pymarket2 = pymarket.set_index('dates')
pymarket2.head(3)

               Tom     Joe  Charlie
dates
10/16/2016  131.10   18.78   210.34
10/17/2016  459.13  424.17   176.03
10/18/2016  338.39  376.78   334.06

In [7]:
pymarket2.loc[pymarket2.isnull().all(axis=1)].index.tolist()[:5] # just print 5

['10/30/2016', '11/5/2016', '12/11/2016', '12/18/2016', '12/21/2016']

### 5) Who spent more than the others and who spent less
return tuple of the names,(max,min)

In [8]:
(pymarket2.max().idxmax(),pymarket2.min().idxmin())

('Tom', 'Joe')

### 6) Who was the guy that visit the market more frecuently
return the name (string)

In [9]:
pymarket2.count().idxmax()

'Charlie'

### 7) Who expense more every end of the mouth

In [10]:
#convert index to timestamp
pymarket['dates']= pd.to_datetime(pymarket['dates']) 
pymarket.iloc[0].dates

Timestamp('2016-10-16 00:00:00')

In [11]:
pymarket.head(3)

       dates     Tom     Joe  Charlie
0 2016-10-16  131.10   18.78   210.34
1 2016-10-17  459.13  424.17   176.03
2 2016-10-18  338.39  376.78   334.06

In [36]:
# create grouper
grouper = pd.Grouper(key='dates', freq='M')

In [39]:
pymarket.groupby(grouper).sum()

                Tom      Joe  Charlie
dates
2016-10-31  3329.53  3350.87  4570.21
2016-11-30  7114.77  5753.44  6638.60
2016-12-31  6389.41  5389.27  7193.99
2017-01-31  6105.83  6376.37  7045.08
2017-02-28  7440.12  5837.02  7430.07
2017-03-31  7271.76  6616.80  6416.68
2017-04-30  6405.35  5859.42  7027.39
2017-05-31  8680.38  7304.30  6357.63
2017-06-30  4744.18  5979.27  5132.72
2017-07-31  6661.58  6788.53  7106.31
2017-08-31  6697.08  7074.52  8424.42
2017-09-30  7073.81  7805.80  7197.65
2017-10-31  7332.81  6330.17  8397.70
2017-11-30  7666.83  4532.00  8028.10
2017-12-31  6793.41  7527.62  6283.24
2018-01-31  7755.21  4657.82  7735.20
2018-02-28  5206.21  5834.91  6413.99
2018-03-31  6931.97  5075.13  6111.45
2018-04-30  5924.02  5615.14  6755.57
2018-05-31  6720.43  6657.54  7480.47
2018-06-30  6009.18  8314.15  5822.96
2018-07-31  4773.85  7839.65  7405.58
2018-08-31  7254.30  6245.56  7860.59
2018-09-30  5351.51  6794.82  5890.94
2018-10-31  6609.68  6665.49  8334.04
2018-11-30  6301.42  7647.52  6852.72
2018-12-31  6287.00  7221.11  7227.87
2019-01-31  7437.95  6854.22  7991.49
2019-02-28  6349.87  6072.78  6153.96
2019-03-31  8049.18  7030.76  6397.47
2019-04-30  7369.99  7089.03  7618.64
2019-05-31  8517.80  7034.89  8236.28
2019-06-30  6301.51  6438.97  7283.64
2019-07-31  3706.60  2951.97  2423.05